zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/pio.h
/* -------- PIO_WPMR : (PIO Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                  */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PIO_WPMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_WPMR_OFFSET                     (0xE4)                                        /**<  (PIO_WPMR) Write Protection Mode Register  Offset */

#define PIO_WPMR_WPEN_Pos                   0                                              /**< (PIO_WPMR) Write Protection Enable Position */
#define PIO_WPMR_WPEN_Msk                   (_U_(0x1) << PIO_WPMR_WPEN_Pos)                /**< (PIO_WPMR) Write Protection Enable Mask */
#define PIO_WPMR_WPEN                       PIO_WPMR_WPEN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_WPMR_WPEN_Msk instead */
#define PIO_WPMR_WPKEY_Pos                  8                                              /**< (PIO_WPMR) Write Protection Key Position */
#define PIO_WPMR_WPKEY_Msk                  (_U_(0xFFFFFF) << PIO_WPMR_WPKEY_Pos)          /**< (PIO_WPMR) Write Protection Key Mask */
#define PIO_WPMR_WPKEY(value)               (PIO_WPMR_WPKEY_Msk & ((value) << PIO_WPMR_WPKEY_Pos))
#define   PIO_WPMR_WPKEY_PASSWD_Val         _U_(0x50494F)                                  /**< (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define PIO_WPMR_WPKEY_PASSWD               (PIO_WPMR_WPKEY_PASSWD_Val << PIO_WPMR_WPKEY_Pos)  /**< (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define PIO_WPMR_MASK                       _U_(0xFFFFFF01)                                /**< \deprecated (PIO_WPMR) Register MASK  (Use PIO_WPMR_Msk instead)  */
#define PIO_WPMR_Msk                        _U_(0xFFFFFF01)                                /**< (PIO_WPMR) Register Mask  */


/* -------- PIO_WPSR : (PIO Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status        */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source        */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PIO_WPSR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_WPSR_OFFSET                     (0xE8)                                        /**<  (PIO_WPSR) Write Protection Status Register  Offset */

#define PIO_WPSR_WPVS_Pos                   0                                              /**< (PIO_WPSR) Write Protection Violation Status Position */
#define PIO_WPSR_WPVS_Msk                   (_U_(0x1) << PIO_WPSR_WPVS_Pos)                /**< (PIO_WPSR) Write Protection Violation Status Mask */
#define PIO_WPSR_WPVS                       PIO_WPSR_WPVS_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_WPSR_WPVS_Msk instead */
#define PIO_WPSR_WPVSRC_Pos                 8                                              /**< (PIO_WPSR) Write Protection Violation Source Position */
#define PIO_WPSR_WPVSRC_Msk                 (_U_(0xFFFF) << PIO_WPSR_WPVSRC_Pos)           /**< (PIO_WPSR) Write Protection Violation Source Mask */
#define PIO_WPSR_WPVSRC(value)              (PIO_WPSR_WPVSRC_Msk & ((value) << PIO_WPSR_WPVSRC_Pos))
#define PIO_WPSR_MASK                       _U_(0xFFFF01)                                  /**< \deprecated (PIO_WPSR) Register MASK  (Use PIO_WPSR_Msk instead)  */
#define PIO_WPSR_Msk                        _U_(0xFFFF01)                                  /**< (PIO_WPSR) Register Mask  */


/* -------- PIO_SCHMITT : (PIO Offset: 0x100) (R/W 32) Schmitt Trigger Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SCHMITT0:1;                /**< bit:      0  Schmitt Trigger Control                  */
    uint32_t SCHMITT1:1;                /**< bit:      1  Schmitt Trigger Control                  */
    uint32_t SCHMITT2:1;                /**< bit:      2  Schmitt Trigger Control                  */
    uint32_t SCHMITT3:1;                /**< bit:      3  Schmitt Trigger Control                  */
    uint32_t SCHMITT4:1;                /**< bit:      4  Schmitt Trigger Control                  */
    uint32_t SCHMITT5:1;                /**< bit:      5  Schmitt Trigger Control                  */
    uint32_t SCHMITT6:1;                /**< bit:      6  Schmitt Trigger Control                  */
    uint32_t SCHMITT7:1;                /**< bit:      7  Schmitt Trigger Control                  */
    uint32_t SCHMITT8:1;                /**< bit:      8  Schmitt Trigger Control                  */
    uint32_t SCHMITT9:1;                /**< bit:      9  Schmitt Trigger Control                  */
    uint32_t SCHMITT10:1;               /**< bit:     10  Schmitt Trigger Control                  */
    uint32_t SCHMITT11:1;               /**< bit:     11  Schmitt Trigger Control                  */
    uint32_t SCHMITT12:1;               /**< bit:     12  Schmitt Trigger Control                  */
    uint32_t SCHMITT13:1;               /**< bit:     13  Schmitt Trigger Control                  */
    uint32_t SCHMITT14:1;               /**< bit:     14  Schmitt Trigger Control                  */
    uint32_t SCHMITT15:1;               /**< bit:     15  Schmitt Trigger Control                  */
    uint32_t SCHMITT16:1;               /**< bit:     16  Schmitt Trigger Control                  */
    uint32_t SCHMITT17:1;               /**< bit:     17  Schmitt Trigger Control                  */
    uint32_t SCHMITT18:1;               /**< bit:     18  Schmitt Trigger Control                  */
    uint32_t SCHMITT19:1;               /**< bit:     19  Schmitt Trigger Control                  */
    uint32_t SCHMITT20:1;               /**< bit:     20  Schmitt Trigger Control                  */
    uint32_t SCHMITT21:1;               /**< bit:     21  Schmitt Trigger Control                  */
    uint32_t SCHMITT22:1;               /**< bit:     22  Schmitt Trigger Control                  */
    uint32_t SCHMITT23:1;               /**< bit:     23  Schmitt Trigger Control                  */
    uint32_t SCHMITT24:1;               /**< bit:     24  Schmitt Trigger Control                  */
    uint32_t SCHMITT25:1;               /**< bit:     25  Schmitt Trigger Control                  */
    uint32_t SCHMITT26:1;               /**< bit:     26  Schmitt Trigger Control                  */
    uint32_t SCHMITT27:1;               /**< bit:     27  Schmitt Trigger Control                  */
    uint32_t SCHMITT28:1;               /**< bit:     28  Schmitt Trigger Control                  */
    uint32_t SCHMITT29:1;               /**< bit:     29  Schmitt Trigger Control                  */
    uint32_t SCHMITT30:1;               /**< bit:     30  Schmitt Trigger Control                  */
    uint32_t SCHMITT31:1;               /**< bit:     31  Schmitt Trigger Control                  */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t SCHMITT:32;                /**< bit:  0..31  Schmitt Trigger Control                  */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_SCHMITT_Type;
