zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/pio.h
#define PIO_SCHMITT_SCHMITT_Pos             0                                              /**< (PIO_SCHMITT Position) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT_Msk             (_U_(0xFFFFFFFF) << PIO_SCHMITT_SCHMITT_Pos)   /**< (PIO_SCHMITT Mask) SCHMITT */
#define PIO_SCHMITT_SCHMITT(value)          (PIO_SCHMITT_SCHMITT_Msk & ((value) << PIO_SCHMITT_SCHMITT_Pos))  

/* -------- PIO_DRIVER : (PIO Offset: 0x118) (R/W 32) I/O Drive Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LINE0:1;                   /**< bit:      0  Drive of PIO Line 0                      */
    uint32_t LINE1:1;                   /**< bit:      1  Drive of PIO Line 1                      */
    uint32_t LINE2:1;                   /**< bit:      2  Drive of PIO Line 2                      */
    uint32_t LINE3:1;                   /**< bit:      3  Drive of PIO Line 3                      */
    uint32_t LINE4:1;                   /**< bit:      4  Drive of PIO Line 4                      */
    uint32_t LINE5:1;                   /**< bit:      5  Drive of PIO Line 5                      */
    uint32_t LINE6:1;                   /**< bit:      6  Drive of PIO Line 6                      */
    uint32_t LINE7:1;                   /**< bit:      7  Drive of PIO Line 7                      */
    uint32_t LINE8:1;                   /**< bit:      8  Drive of PIO Line 8                      */
    uint32_t LINE9:1;                   /**< bit:      9  Drive of PIO Line 9                      */
    uint32_t LINE10:1;                  /**< bit:     10  Drive of PIO Line 10                     */
    uint32_t LINE11:1;                  /**< bit:     11  Drive of PIO Line 11                     */
    uint32_t LINE12:1;                  /**< bit:     12  Drive of PIO Line 12                     */
    uint32_t LINE13:1;                  /**< bit:     13  Drive of PIO Line 13                     */
    uint32_t LINE14:1;                  /**< bit:     14  Drive of PIO Line 14                     */
    uint32_t LINE15:1;                  /**< bit:     15  Drive of PIO Line 15                     */
    uint32_t LINE16:1;                  /**< bit:     16  Drive of PIO Line 16                     */
    uint32_t LINE17:1;                  /**< bit:     17  Drive of PIO Line 17                     */
    uint32_t LINE18:1;                  /**< bit:     18  Drive of PIO Line 18                     */
    uint32_t LINE19:1;                  /**< bit:     19  Drive of PIO Line 19                     */
    uint32_t LINE20:1;                  /**< bit:     20  Drive of PIO Line 20                     */
    uint32_t LINE21:1;                  /**< bit:     21  Drive of PIO Line 21                     */
    uint32_t LINE22:1;                  /**< bit:     22  Drive of PIO Line 22                     */
    uint32_t LINE23:1;                  /**< bit:     23  Drive of PIO Line 23                     */
    uint32_t LINE24:1;                  /**< bit:     24  Drive of PIO Line 24                     */
    uint32_t LINE25:1;                  /**< bit:     25  Drive of PIO Line 25                     */
    uint32_t LINE26:1;                  /**< bit:     26  Drive of PIO Line 26                     */
    uint32_t LINE27:1;                  /**< bit:     27  Drive of PIO Line 27                     */
    uint32_t LINE28:1;                  /**< bit:     28  Drive of PIO Line 28                     */
    uint32_t LINE29:1;                  /**< bit:     29  Drive of PIO Line 29                     */
    uint32_t LINE30:1;                  /**< bit:     30  Drive of PIO Line 30                     */
    uint32_t LINE31:1;                  /**< bit:     31  Drive of PIO Line 31                     */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t LINE:32;                   /**< bit:  0..31  Drive of PIO Line 3x                     */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_DRIVER_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_DRIVER_OFFSET                   (0x118)                                       /**<  (PIO_DRIVER) I/O Drive Register  Offset */

#define PIO_DRIVER_LINE0_Pos                0                                              /**< (PIO_DRIVER) Drive of PIO Line 0 Position */
#define PIO_DRIVER_LINE0_Msk                (_U_(0x1) << PIO_DRIVER_LINE0_Pos)             /**< (PIO_DRIVER) Drive of PIO Line 0 Mask */
#define PIO_DRIVER_LINE0                    PIO_DRIVER_LINE0_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE0_Msk instead */
#define   PIO_DRIVER_LINE0_LOW_DRIVE_Val    _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE0_HIGH_DRIVE_Val   _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE0_LOW_DRIVE          (PIO_DRIVER_LINE0_LOW_DRIVE_Val << PIO_DRIVER_LINE0_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE0_HIGH_DRIVE         (PIO_DRIVER_LINE0_HIGH_DRIVE_Val << PIO_DRIVER_LINE0_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE1_Pos                1                                              /**< (PIO_DRIVER) Drive of PIO Line 1 Position */
#define PIO_DRIVER_LINE1_Msk                (_U_(0x1) << PIO_DRIVER_LINE1_Pos)             /**< (PIO_DRIVER) Drive of PIO Line 1 Mask */
#define PIO_DRIVER_LINE1                    PIO_DRIVER_LINE1_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE1_Msk instead */
#define   PIO_DRIVER_LINE1_LOW_DRIVE_Val    _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE1_HIGH_DRIVE_Val   _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE1_LOW_DRIVE          (PIO_DRIVER_LINE1_LOW_DRIVE_Val << PIO_DRIVER_LINE1_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE1_HIGH_DRIVE         (PIO_DRIVER_LINE1_HIGH_DRIVE_Val << PIO_DRIVER_LINE1_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE2_Pos                2                                              /**< (PIO_DRIVER) Drive of PIO Line 2 Position */
#define PIO_DRIVER_LINE2_Msk                (_U_(0x1) << PIO_DRIVER_LINE2_Pos)             /**< (PIO_DRIVER) Drive of PIO Line 2 Mask */
#define PIO_DRIVER_LINE2                    PIO_DRIVER_LINE2_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE2_Msk instead */
#define   PIO_DRIVER_LINE2_LOW_DRIVE_Val    _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE2_HIGH_DRIVE_Val   _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE2_LOW_DRIVE          (PIO_DRIVER_LINE2_LOW_DRIVE_Val << PIO_DRIVER_LINE2_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE2_HIGH_DRIVE         (PIO_DRIVER_LINE2_HIGH_DRIVE_Val << PIO_DRIVER_LINE2_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE3_Pos                3                                              /**< (PIO_DRIVER) Drive of PIO Line 3 Position */
#define PIO_DRIVER_LINE3_Msk                (_U_(0x1) << PIO_DRIVER_LINE3_Pos)             /**< (PIO_DRIVER) Drive of PIO Line 3 Mask */
#define PIO_DRIVER_LINE3                    PIO_DRIVER_LINE3_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE3_Msk instead */
#define   PIO_DRIVER_LINE3_LOW_DRIVE_Val    _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE3_HIGH_DRIVE_Val   _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE3_LOW_DRIVE          (PIO_DRIVER_LINE3_LOW_DRIVE_Val << PIO_DRIVER_LINE3_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE3_HIGH_DRIVE         (PIO_DRIVER_LINE3_HIGH_DRIVE_Val << PIO_DRIVER_LINE3_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE4_Pos                4                                              /**< (PIO_DRIVER) Drive of PIO Line 4 Position */
#define PIO_DRIVER_LINE4_Msk                (_U_(0x1) << PIO_DRIVER_LINE4_Pos)             /**< (PIO_DRIVER) Drive of PIO Line 4 Mask */
#define PIO_DRIVER_LINE4                    PIO_DRIVER_LINE4_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE4_Msk instead */
#define   PIO_DRIVER_LINE4_LOW_DRIVE_Val    _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE4_HIGH_DRIVE_Val   _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE4_LOW_DRIVE          (PIO_DRIVER_LINE4_LOW_DRIVE_Val << PIO_DRIVER_LINE4_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE4_HIGH_DRIVE         (PIO_DRIVER_LINE4_HIGH_DRIVE_Val << PIO_DRIVER_LINE4_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE5_Pos                5                                              /**< (PIO_DRIVER) Drive of PIO Line 5 Position */
#define PIO_DRIVER_LINE5_Msk                (_U_(0x1) << PIO_DRIVER_LINE5_Pos)             /**< (PIO_DRIVER) Drive of PIO Line 5 Mask */
#define PIO_DRIVER_LINE5                    PIO_DRIVER_LINE5_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE5_Msk instead */
#define   PIO_DRIVER_LINE5_LOW_DRIVE_Val    _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE5_HIGH_DRIVE_Val   _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE5_LOW_DRIVE          (PIO_DRIVER_LINE5_LOW_DRIVE_Val << PIO_DRIVER_LINE5_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE5_HIGH_DRIVE         (PIO_DRIVER_LINE5_HIGH_DRIVE_Val << PIO_DRIVER_LINE5_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE6_Pos                6                                              /**< (PIO_DRIVER) Drive of PIO Line 6 Position */
#define PIO_DRIVER_LINE6_Msk                (_U_(0x1) << PIO_DRIVER_LINE6_Pos)             /**< (PIO_DRIVER) Drive of PIO Line 6 Mask */
#define PIO_DRIVER_LINE6                    PIO_DRIVER_LINE6_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE6_Msk instead */
#define   PIO_DRIVER_LINE6_LOW_DRIVE_Val    _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE6_HIGH_DRIVE_Val   _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE6_LOW_DRIVE          (PIO_DRIVER_LINE6_LOW_DRIVE_Val << PIO_DRIVER_LINE6_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE6_HIGH_DRIVE         (PIO_DRIVER_LINE6_HIGH_DRIVE_Val << PIO_DRIVER_LINE6_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE7_Pos                7                                              /**< (PIO_DRIVER) Drive of PIO Line 7 Position */
#define PIO_DRIVER_LINE7_Msk                (_U_(0x1) << PIO_DRIVER_LINE7_Pos)             /**< (PIO_DRIVER) Drive of PIO Line 7 Mask */
#define PIO_DRIVER_LINE7                    PIO_DRIVER_LINE7_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE7_Msk instead */
#define   PIO_DRIVER_LINE7_LOW_DRIVE_Val    _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE7_HIGH_DRIVE_Val   _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE7_LOW_DRIVE          (PIO_DRIVER_LINE7_LOW_DRIVE_Val << PIO_DRIVER_LINE7_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE7_HIGH_DRIVE         (PIO_DRIVER_LINE7_HIGH_DRIVE_Val << PIO_DRIVER_LINE7_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE8_Pos                8                                              /**< (PIO_DRIVER) Drive of PIO Line 8 Position */
#define PIO_DRIVER_LINE8_Msk                (_U_(0x1) << PIO_DRIVER_LINE8_Pos)             /**< (PIO_DRIVER) Drive of PIO Line 8 Mask */
#define PIO_DRIVER_LINE8                    PIO_DRIVER_LINE8_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE8_Msk instead */
#define   PIO_DRIVER_LINE8_LOW_DRIVE_Val    _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE8_HIGH_DRIVE_Val   _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE8_LOW_DRIVE          (PIO_DRIVER_LINE8_LOW_DRIVE_Val << PIO_DRIVER_LINE8_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE8_HIGH_DRIVE         (PIO_DRIVER_LINE8_HIGH_DRIVE_Val << PIO_DRIVER_LINE8_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE9_Pos                9                                              /**< (PIO_DRIVER) Drive of PIO Line 9 Position */
#define PIO_DRIVER_LINE9_Msk                (_U_(0x1) << PIO_DRIVER_LINE9_Pos)             /**< (PIO_DRIVER) Drive of PIO Line 9 Mask */
#define PIO_DRIVER_LINE9                    PIO_DRIVER_LINE9_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE9_Msk instead */
#define   PIO_DRIVER_LINE9_LOW_DRIVE_Val    _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE9_HIGH_DRIVE_Val   _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE9_LOW_DRIVE          (PIO_DRIVER_LINE9_LOW_DRIVE_Val << PIO_DRIVER_LINE9_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE9_HIGH_DRIVE         (PIO_DRIVER_LINE9_HIGH_DRIVE_Val << PIO_DRIVER_LINE9_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE10_Pos               10                                             /**< (PIO_DRIVER) Drive of PIO Line 10 Position */
#define PIO_DRIVER_LINE10_Msk               (_U_(0x1) << PIO_DRIVER_LINE10_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 10 Mask */
#define PIO_DRIVER_LINE10                   PIO_DRIVER_LINE10_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE10_Msk instead */
#define   PIO_DRIVER_LINE10_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE10_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE10_LOW_DRIVE         (PIO_DRIVER_LINE10_LOW_DRIVE_Val << PIO_DRIVER_LINE10_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE10_HIGH_DRIVE        (PIO_DRIVER_LINE10_HIGH_DRIVE_Val << PIO_DRIVER_LINE10_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE11_Pos               11                                             /**< (PIO_DRIVER) Drive of PIO Line 11 Position */
#define PIO_DRIVER_LINE11_Msk               (_U_(0x1) << PIO_DRIVER_LINE11_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 11 Mask */
#define PIO_DRIVER_LINE11                   PIO_DRIVER_LINE11_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE11_Msk instead */
#define   PIO_DRIVER_LINE11_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE11_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE11_LOW_DRIVE         (PIO_DRIVER_LINE11_LOW_DRIVE_Val << PIO_DRIVER_LINE11_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE11_HIGH_DRIVE        (PIO_DRIVER_LINE11_HIGH_DRIVE_Val << PIO_DRIVER_LINE11_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE12_Pos               12                                             /**< (PIO_DRIVER) Drive of PIO Line 12 Position */
#define PIO_DRIVER_LINE12_Msk               (_U_(0x1) << PIO_DRIVER_LINE12_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 12 Mask */
#define PIO_DRIVER_LINE12                   PIO_DRIVER_LINE12_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE12_Msk instead */
#define   PIO_DRIVER_LINE12_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE12_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE12_LOW_DRIVE         (PIO_DRIVER_LINE12_LOW_DRIVE_Val << PIO_DRIVER_LINE12_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE12_HIGH_DRIVE        (PIO_DRIVER_LINE12_HIGH_DRIVE_Val << PIO_DRIVER_LINE12_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE13_Pos               13                                             /**< (PIO_DRIVER) Drive of PIO Line 13 Position */
#define PIO_DRIVER_LINE13_Msk               (_U_(0x1) << PIO_DRIVER_LINE13_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 13 Mask */
#define PIO_DRIVER_LINE13                   PIO_DRIVER_LINE13_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE13_Msk instead */
#define   PIO_DRIVER_LINE13_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE13_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE13_LOW_DRIVE         (PIO_DRIVER_LINE13_LOW_DRIVE_Val << PIO_DRIVER_LINE13_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE13_HIGH_DRIVE        (PIO_DRIVER_LINE13_HIGH_DRIVE_Val << PIO_DRIVER_LINE13_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE14_Pos               14                                             /**< (PIO_DRIVER) Drive of PIO Line 14 Position */
#define PIO_DRIVER_LINE14_Msk               (_U_(0x1) << PIO_DRIVER_LINE14_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 14 Mask */
#define PIO_DRIVER_LINE14                   PIO_DRIVER_LINE14_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE14_Msk instead */
#define   PIO_DRIVER_LINE14_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE14_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE14_LOW_DRIVE         (PIO_DRIVER_LINE14_LOW_DRIVE_Val << PIO_DRIVER_LINE14_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE14_HIGH_DRIVE        (PIO_DRIVER_LINE14_HIGH_DRIVE_Val << PIO_DRIVER_LINE14_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE15_Pos               15                                             /**< (PIO_DRIVER) Drive of PIO Line 15 Position */
#define PIO_DRIVER_LINE15_Msk               (_U_(0x1) << PIO_DRIVER_LINE15_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 15 Mask */
#define PIO_DRIVER_LINE15                   PIO_DRIVER_LINE15_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE15_Msk instead */
#define   PIO_DRIVER_LINE15_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE15_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE15_LOW_DRIVE         (PIO_DRIVER_LINE15_LOW_DRIVE_Val << PIO_DRIVER_LINE15_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE15_HIGH_DRIVE        (PIO_DRIVER_LINE15_HIGH_DRIVE_Val << PIO_DRIVER_LINE15_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE16_Pos               16                                             /**< (PIO_DRIVER) Drive of PIO Line 16 Position */
#define PIO_DRIVER_LINE16_Msk               (_U_(0x1) << PIO_DRIVER_LINE16_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 16 Mask */
#define PIO_DRIVER_LINE16                   PIO_DRIVER_LINE16_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE16_Msk instead */
#define   PIO_DRIVER_LINE16_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE16_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE16_LOW_DRIVE         (PIO_DRIVER_LINE16_LOW_DRIVE_Val << PIO_DRIVER_LINE16_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE16_HIGH_DRIVE        (PIO_DRIVER_LINE16_HIGH_DRIVE_Val << PIO_DRIVER_LINE16_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE17_Pos               17                                             /**< (PIO_DRIVER) Drive of PIO Line 17 Position */
#define PIO_DRIVER_LINE17_Msk               (_U_(0x1) << PIO_DRIVER_LINE17_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 17 Mask */
#define PIO_DRIVER_LINE17                   PIO_DRIVER_LINE17_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE17_Msk instead */
#define   PIO_DRIVER_LINE17_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE17_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE17_LOW_DRIVE         (PIO_DRIVER_LINE17_LOW_DRIVE_Val << PIO_DRIVER_LINE17_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE17_HIGH_DRIVE        (PIO_DRIVER_LINE17_HIGH_DRIVE_Val << PIO_DRIVER_LINE17_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE18_Pos               18                                             /**< (PIO_DRIVER) Drive of PIO Line 18 Position */
#define PIO_DRIVER_LINE18_Msk               (_U_(0x1) << PIO_DRIVER_LINE18_Pos)            /**< (PIO_DRIVER) Drive of PIO Line 18 Mask */
#define PIO_DRIVER_LINE18                   PIO_DRIVER_LINE18_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_DRIVER_LINE18_Msk instead */
#define   PIO_DRIVER_LINE18_LOW_DRIVE_Val   _U_(0x0)                                       /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE18_HIGH_DRIVE_Val  _U_(0x1)                                       /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE18_LOW_DRIVE         (PIO_DRIVER_LINE18_LOW_DRIVE_Val << PIO_DRIVER_LINE18_Pos)  /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE18_HIGH_DRIVE        (PIO_DRIVER_LINE18_HIGH_DRIVE_Val << PIO_DRIVER_LINE18_Pos)  /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE19_Pos               19                                             /**< (PIO_DRIVER) Drive of PIO Line 19 Position */
