zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/pio.h
/* -------- PIO_PCMR : (PIO Offset: 0x150) (R/W 32) Parallel Capture Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t PCEN:1;                    /**< bit:      0  Parallel Capture Mode Enable             */
    uint32_t :3;                        /**< bit:   1..3  Reserved */
    uint32_t DSIZE:2;                   /**< bit:   4..5  Parallel Capture Mode Data Size          */
    uint32_t :3;                        /**< bit:   6..8  Reserved */
    uint32_t ALWYS:1;                   /**< bit:      9  Parallel Capture Mode Always Sampling    */
    uint32_t HALFS:1;                   /**< bit:     10  Parallel Capture Mode Half Sampling      */
    uint32_t FRSTS:1;                   /**< bit:     11  Parallel Capture Mode First Sample       */
    uint32_t :20;                       /**< bit: 12..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PIO_PCMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_PCMR_OFFSET                     (0x150)                                       /**<  (PIO_PCMR) Parallel Capture Mode Register  Offset */

#define PIO_PCMR_PCEN_Pos                   0                                              /**< (PIO_PCMR) Parallel Capture Mode Enable Position */
#define PIO_PCMR_PCEN_Msk                   (_U_(0x1) << PIO_PCMR_PCEN_Pos)                /**< (PIO_PCMR) Parallel Capture Mode Enable Mask */
#define PIO_PCMR_PCEN                       PIO_PCMR_PCEN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCMR_PCEN_Msk instead */
#define PIO_PCMR_DSIZE_Pos                  4                                              /**< (PIO_PCMR) Parallel Capture Mode Data Size Position */
#define PIO_PCMR_DSIZE_Msk                  (_U_(0x3) << PIO_PCMR_DSIZE_Pos)               /**< (PIO_PCMR) Parallel Capture Mode Data Size Mask */
#define PIO_PCMR_DSIZE(value)               (PIO_PCMR_DSIZE_Msk & ((value) << PIO_PCMR_DSIZE_Pos))
#define   PIO_PCMR_DSIZE_BYTE_Val           _U_(0x0)                                       /**< (PIO_PCMR) The reception data in the PIO_PCRHR is a byte (8-bit)  */
#define   PIO_PCMR_DSIZE_HALFWORD_Val       _U_(0x1)                                       /**< (PIO_PCMR) The reception data in the PIO_PCRHR is a half-word (16-bit)  */
#define   PIO_PCMR_DSIZE_WORD_Val           _U_(0x2)                                       /**< (PIO_PCMR) The reception data in the PIO_PCRHR is a word (32-bit)  */
#define PIO_PCMR_DSIZE_BYTE                 (PIO_PCMR_DSIZE_BYTE_Val << PIO_PCMR_DSIZE_Pos)  /**< (PIO_PCMR) The reception data in the PIO_PCRHR is a byte (8-bit) Position  */
#define PIO_PCMR_DSIZE_HALFWORD             (PIO_PCMR_DSIZE_HALFWORD_Val << PIO_PCMR_DSIZE_Pos)  /**< (PIO_PCMR) The reception data in the PIO_PCRHR is a half-word (16-bit) Position  */
#define PIO_PCMR_DSIZE_WORD                 (PIO_PCMR_DSIZE_WORD_Val << PIO_PCMR_DSIZE_Pos)  /**< (PIO_PCMR) The reception data in the PIO_PCRHR is a word (32-bit) Position  */
#define PIO_PCMR_ALWYS_Pos                  9                                              /**< (PIO_PCMR) Parallel Capture Mode Always Sampling Position */
#define PIO_PCMR_ALWYS_Msk                  (_U_(0x1) << PIO_PCMR_ALWYS_Pos)               /**< (PIO_PCMR) Parallel Capture Mode Always Sampling Mask */
#define PIO_PCMR_ALWYS                      PIO_PCMR_ALWYS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCMR_ALWYS_Msk instead */
#define PIO_PCMR_HALFS_Pos                  10                                             /**< (PIO_PCMR) Parallel Capture Mode Half Sampling Position */
#define PIO_PCMR_HALFS_Msk                  (_U_(0x1) << PIO_PCMR_HALFS_Pos)               /**< (PIO_PCMR) Parallel Capture Mode Half Sampling Mask */
#define PIO_PCMR_HALFS                      PIO_PCMR_HALFS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCMR_HALFS_Msk instead */
#define PIO_PCMR_FRSTS_Pos                  11                                             /**< (PIO_PCMR) Parallel Capture Mode First Sample Position */
#define PIO_PCMR_FRSTS_Msk                  (_U_(0x1) << PIO_PCMR_FRSTS_Pos)               /**< (PIO_PCMR) Parallel Capture Mode First Sample Mask */
#define PIO_PCMR_FRSTS                      PIO_PCMR_FRSTS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCMR_FRSTS_Msk instead */
#define PIO_PCMR_MASK                       _U_(0xE31)                                     /**< \deprecated (PIO_PCMR) Register MASK  (Use PIO_PCMR_Msk instead)  */
#define PIO_PCMR_Msk                        _U_(0xE31)                                     /**< (PIO_PCMR) Register Mask  */


/* -------- PIO_PCIER : (PIO Offset: 0x154) (/W 32) Parallel Capture Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DRDY:1;                    /**< bit:      0  Parallel Capture Mode Data Ready Interrupt Enable */
    uint32_t OVRE:1;                    /**< bit:      1  Parallel Capture Mode Overrun Error Interrupt Enable */
    uint32_t ENDRX:1;                   /**< bit:      2  End of Reception Transfer Interrupt Enable */
    uint32_t RXBUFF:1;                  /**< bit:      3  Reception Buffer Full Interrupt Enable   */
    uint32_t :28;                       /**< bit:  4..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PIO_PCIER_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_PCIER_OFFSET                    (0x154)                                       /**<  (PIO_PCIER) Parallel Capture Interrupt Enable Register  Offset */

#define PIO_PCIER_DRDY_Pos                  0                                              /**< (PIO_PCIER) Parallel Capture Mode Data Ready Interrupt Enable Position */
#define PIO_PCIER_DRDY_Msk                  (_U_(0x1) << PIO_PCIER_DRDY_Pos)               /**< (PIO_PCIER) Parallel Capture Mode Data Ready Interrupt Enable Mask */
#define PIO_PCIER_DRDY                      PIO_PCIER_DRDY_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIER_DRDY_Msk instead */
#define PIO_PCIER_OVRE_Pos                  1                                              /**< (PIO_PCIER) Parallel Capture Mode Overrun Error Interrupt Enable Position */
#define PIO_PCIER_OVRE_Msk                  (_U_(0x1) << PIO_PCIER_OVRE_Pos)               /**< (PIO_PCIER) Parallel Capture Mode Overrun Error Interrupt Enable Mask */
#define PIO_PCIER_OVRE                      PIO_PCIER_OVRE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIER_OVRE_Msk instead */
#define PIO_PCIER_ENDRX_Pos                 2                                              /**< (PIO_PCIER) End of Reception Transfer Interrupt Enable Position */
#define PIO_PCIER_ENDRX_Msk                 (_U_(0x1) << PIO_PCIER_ENDRX_Pos)              /**< (PIO_PCIER) End of Reception Transfer Interrupt Enable Mask */
#define PIO_PCIER_ENDRX                     PIO_PCIER_ENDRX_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIER_ENDRX_Msk instead */
#define PIO_PCIER_RXBUFF_Pos                3                                              /**< (PIO_PCIER) Reception Buffer Full Interrupt Enable Position */
#define PIO_PCIER_RXBUFF_Msk                (_U_(0x1) << PIO_PCIER_RXBUFF_Pos)             /**< (PIO_PCIER) Reception Buffer Full Interrupt Enable Mask */
#define PIO_PCIER_RXBUFF                    PIO_PCIER_RXBUFF_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_PCIER_RXBUFF_Msk instead */
#define PIO_PCIER_MASK                      _U_(0x0F)                                      /**< \deprecated (PIO_PCIER) Register MASK  (Use PIO_PCIER_Msk instead)  */
#define PIO_PCIER_Msk                       _U_(0x0F)                                      /**< (PIO_PCIER) Register Mask  */


/* -------- PIO_PCIDR : (PIO Offset: 0x158) (/W 32) Parallel Capture Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DRDY:1;                    /**< bit:      0  Parallel Capture Mode Data Ready Interrupt Disable */
    uint32_t OVRE:1;                    /**< bit:      1  Parallel Capture Mode Overrun Error Interrupt Disable */
    uint32_t ENDRX:1;                   /**< bit:      2  End of Reception Transfer Interrupt Disable */
    uint32_t RXBUFF:1;                  /**< bit:      3  Reception Buffer Full Interrupt Disable  */
    uint32_t :28;                       /**< bit:  4..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PIO_PCIDR_Type;
